app/controllers/players_controller.rb

SELECT COUNT(*) FROM "players"
SELECT DISTINCT "players".* FROM "players" ORDER BY id ASC LIMIT 10 OFFSET 0
---
  def index
    @q = Player.search(params[:q])
    @players = @q.result(:distinct => true).paginate(page: params[:page]).order('id ASC')